# Даны два файла в каждом из которых находится запись многочлена. Сформировать файл содержащий сумму многочленов.

first_polynom = "13*x^5 + 61*x^4 + 91*x^3 + 66*x^2 + 65*x + 6 = 0"
second_polynom = "15*x^5 + 5*x^4 + 13*x3 + 2*x^2 + 10*x + 2 = 0"

tmp = first_polynom[:-4]

print(tmp)